## Cleaning dataset

In [38]:
import pandas as pd

In [39]:
dataset=pd.read_csv("Customer detail.csv")

In [40]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali Khan,Laptop,1.0,85000,Lahor,Cash
1,1002,2024/01/07,ALI KHAN,Mouse,2.0,1500,Lahore,Card
2,1003,2024-01-07,Sara Ahmed,Laptop,NaN,85000,Karachi,Cash
3,1004,07-01-2024,John Doe,Keyboard,1.0,3500,Lahore,Card
4,1005,2024-01-08,John Doe,Keyboard,1.0,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3.0,1200,Islamabad,Cash
6,1007,2024-01-10,Ali Khan,Mouse,2.0,1500,Lahore,Card
7,1008,2024-01-11,Sara Ahmed,Laptop,1.0,85000,Karachii,Cash
8,1009,2024-15-01,Kashif Khan,Headphones,1.0,5000,Islamabad,Cash
9,1010,2024-01-12,NaN,Laptop,1.0,85000,Lahore,Card

In [41]:
dataset.columns

Index(['Order_ID', 'Date', 'Customer_Name', 'Product', 'Quantity', 'Price',
       'City', 'Payment_Method'],
      dtype='object')

In [42]:
dataset.values

array([[1001, '2024-01-05', 'Ali Khan', 'Laptop', 1.0, 85000, 'Lahor',
        'Cash'],
       [1002, '2024/01/07', 'ALI  KHAN', 'Mouse', 2.0, 1500, 'Lahore',
        'Card'],
       [1003, '2024-01-07', 'Sara Ahmed', 'Laptop', nan, 85000,
        'Karachi', 'Cash'],
       [1004, '07-01-2024', 'John Doe', 'Keyboard', 1.0, 3500, 'Lahore',
        'Card'],
       [1005, '2024-01-08', 'John Doe', 'Keyboard', 1.0, 3500, 'Lahore',
        'Card'],
       [1006, '2024-01-09', 'Ahmad ', 'Charger', 3.0, 1200, 'Islamabad',
        'Cash'],
       [1007, '2024-01-10', 'Ali Khan', 'Mouse', 2.0, 1500, 'Lahore',
        'Card'],
       [1008, '2024-01-11', 'Sara Ahmed', 'Laptop', 1.0, 85000,
        'Karachii', 'Cash'],
       [1009, '2024-15-01', 'Kashif Khan', 'Headphones', 1.0, 5000,
        'Islamabad', 'Cash'],
       [1010, '2024-01-12', nan, 'Laptop', 1.0, 85000, 'Lahore', 'Card']],
      dtype=object)

In [43]:
dataset.index

RangeIndex(start=0, stop=10, step=1)

In [44]:
dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 8 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Order_ID        10 non-null     int64
 1   Date            10 non-null     object
 2   Customer_Name   9 non-null      object
 3   Product         10 non-null     object
 4   Quantity        9 non-null      float64
 5   Price           10 non-null     int64
 6   City            10 non-null     object
 7   Payment_Method  10 non-null     object
dtypes: float64(1), int64(2), object(5)
memory usage: 772.0+ bytes

In [45]:
dataset.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
9    False
dtype: bool

In [46]:
dataset["Customer_Name"].duplicated()

0    False
1    False
2    False
3    False
4     True
5    False
6     True
7     True
8    False
9    False
Name: Customer_Name, dtype: bool

In [47]:
dataset.isnull()

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,True,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
5,False,False,False,False,False,False,False,False
6,False,False,False,False,False,False,False,False
7,False,False,False,False,False,False,False,False
8,False,False,False,False,False,False,False,False
9,False,False,True,False,False,False,False,False

In [48]:
dataset["Quantity"].isnull()

0    False
1    False
2     True
3    False
4    False
5    False
6    False
7    False
8    False
9    False
Name: Quantity, dtype: bool

In [49]:
dataset=dataset.dropna(subset=["Quantity"])

In [50]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali Khan,Laptop,1.0,85000,Lahor,Cash
1,1002,2024/01/07,ALI KHAN,Mouse,2.0,1500,Lahore,Card
3,1004,07-01-2024,John Doe,Keyboard,1.0,3500,Lahore,Card
4,1005,2024-01-08,John Doe,Keyboard,1.0,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3.0,1200,Islamabad,Cash
6,1007,2024-01-10,Ali Khan,Mouse,2.0,1500,Lahore,Card
7,1008,2024-01-11,Sara Ahmed,Laptop,1.0,85000,Karachii,Cash
8,1009,2024-15-01,Kashif Khan,Headphones,1.0,5000,Islamabad,Cash
9,1010,2024-01-12,NaN,Laptop,1.0,85000,Lahore,Card

In [51]:
dataset=dataset.dropna(subset=["Customer_Name"])

In [52]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali Khan,Laptop,1.0,85000,Lahor,Cash
1,1002,2024/01/07,ALI KHAN,Mouse,2.0,1500,Lahore,Card
3,1004,07-01-2024,John Doe,Keyboard,1.0,3500,Lahore,Card
4,1005,2024-01-08,John Doe,Keyboard,1.0,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3.0,1200,Islamabad,Cash
6,1007,2024-01-10,Ali Khan,Mouse,2.0,1500,Lahore,Card
7,1008,2024-01-11,Sara Ahmed,Laptop,1.0,85000,Karachii,Cash
8,1009,2024-15-01,Kashif Khan,Headphones,1.0,5000,Islamabad,Cash

In [53]:
dataset["City"]=dataset["City"].replace({
    "Lahor":"Lahore",
    "Karachii":"Karachi"})

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\635881963.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["City"]=dataset["City"].replace({

In [54]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali Khan,Laptop,1.0,85000,Lahore,Cash
1,1002,2024/01/07,ALI KHAN,Mouse,2.0,1500,Lahore,Card
3,1004,07-01-2024,John Doe,Keyboard,1.0,3500,Lahore,Card
4,1005,2024-01-08,John Doe,Keyboard,1.0,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3.0,1200,Islamabad,Cash
6,1007,2024-01-10,Ali Khan,Mouse,2.0,1500,Lahore,Card
7,1008,2024-01-11,Sara Ahmed,Laptop,1.0,85000,Karachi,Cash
8,1009,2024-15-01,Kashif Khan,Headphones,1.0,5000,Islamabad,Cash

In [55]:
dataset["Customer_Name"]=dataset["Customer_Name"].str.capitalize()

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\2358805860.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Customer_Name"]=dataset["Customer_Name"].str.capitalize()

In [56]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali khan,Laptop,1.0,85000,Lahore,Cash
1,1002,2024/01/07,Ali khan,Mouse,2.0,1500,Lahore,Card
3,1004,07-01-2024,John doe,Keyboard,1.0,3500,Lahore,Card
4,1005,2024-01-08,John doe,Keyboard,1.0,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3.0,1200,Islamabad,Cash
6,1007,2024-01-10,Ali khan,Mouse,2.0,1500,Lahore,Card
7,1008,2024-01-11,Sara ahmed,Laptop,1.0,85000,Karachi,Cash
8,1009,2024-15-01,Kashif khan,Headphones,1.0,5000,Islamabad,Cash

In [57]:
dataset["Quantity"]=dataset["Quantity"].astype(int)

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\733308582.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Quantity"]=dataset["Quantity"].astype(int)

In [58]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash
1,1002,2024/01/07,Ali khan,Mouse,2,1500,Lahore,Card
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash

## Feature Engineering

In [59]:
def discount(price):
    if 1500<price<=5000:
        return "5%"
    elif 5000<price<=50000:
        return "10%"
    elif 50000<price<=100000:
        return "20%"
    else:
        return "0%"

In [60]:
dataset["Discount"]=dataset["Price"].apply(discount)

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\3561505083.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Discount"]=dataset["Price"].apply(discount)

In [61]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method,Discount
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash,20%
1,1002,2024/01/07,Ali khan,Mouse,2,1500,Lahore,Card,0%
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card,5%
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card,5%
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash,0%
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card,0%
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash,20%
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash,5%

In [62]:
def discount_price(discount,price):
    if discount=="5%":
        return price*5/100
    elif discount=="10%":
        return price*10/100
    elif discount == "15%":
        return price*15/100
    elif discount == "20%":
        return price*20/100
    else:
        return 0

In [63]:
dataset["Discount_Price"]=dataset["Price"]*dataset["Discount"].str.rstrip("%").astype(int)/100

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\3168749751.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Discount_Price"]=dataset["Price"]*dataset["Discount"].str.rstrip("%").astype(int)/100

In [64]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method,Discount,Discount_Price
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash,20%,17000.0
1,1002,2024/01/07,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash,0%,0.0
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash,20%,17000.0
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash,5%,250.0

In [65]:
dataset["Final Price"]=dataset["Price"]-dataset["Discount_Price"]

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\3367379631.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Final Price"]=dataset["Price"]-dataset["Discount_Price"]

In [66]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method,Discount,Discount_Price,Final Price
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash,20%,17000.0,68000.0
1,1002,2024/01/07,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash,0%,0.0,1200.0
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash,20%,17000.0,68000.0
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash,5%,250.0,4750.0

In [67]:
dataset["Date"]=dataset["Date"].str.replace("/","-")

C:\Users\Shah\AppData\Local\Temp\ipykernel_16216\2177561270.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  dataset["Date"]=dataset["Date"].str.replace("/","-")

In [68]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method,Discount,Discount_Price,Final Price
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash,20%,17000.0,68000.0
1,1002,2024-01-07,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash,0%,0.0,1200.0
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash,20%,17000.0,68000.0
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash,5%,250.0,4750.0

In [71]:
dataset.loc[dataset["Date"]=="07-01-2024",dataset["Date"]]="2024-01-07"

In [72]:
dataset

,Order_ID,Date,Customer_Name,Product,Quantity,Price,City,Payment_Method,Discount,Discount_Price,Final Price,2024-01-05,2024-01-07,07-01-2024,2024-01-08,2024-01-09,2024-01-10,2024-01-11,2024-15-01
0,1001,2024-01-05,Ali khan,Laptop,1,85000,Lahore,Cash,20%,17000.0,68000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,1002,2024-01-07,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,1004,07-01-2024,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0,2024-01-07,2024-01-07,2024-01-07,2024-01-07,2024-01-07,2024-01-07,2024-01-07,2024-01-07
4,1005,2024-01-08,John doe,Keyboard,1,3500,Lahore,Card,5%,175.0,3325.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,1006,2024-01-09,Ahmad,Charger,3,1200,Islamabad,Cash,0%,0.0,1200.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6,1007,2024-01-10,Ali khan,Mouse,2,1500,Lahore,Card,0%,0.0,1500.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
7,1008,2024-01-11,Sara ahmed,Laptop,1,85000,Karachi,Cash,20%,17000.0,68000.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,1009,2024-15-01,Kashif khan,Headphones,1,5000,Islamabad,Cash,5%,250.0,4750.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN